veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGtm_reg.h
/** \brief EA1AC, ATOM4 Channel 3 Interrupt Mode Configuration Register */
#define GTM_ATOM4_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EA1ACu)

/** \brief EA200, ATOM4 Channel 4 ARU read address Register */
#define GTM_ATOM4_CH4_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EA200u)

/** \brief EA204, ATOM4 Channel 4 Control Register */
#define GTM_ATOM4_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EA204u)

/** \brief EA204, ATOM4 Channel 4 Control Register in SOMB Mode */
#define GTM_ATOM4_CH4_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EA204u)

/** \brief EA204, ATOM4 Channel 4 Control Register in SOMC Mode */
#define GTM_ATOM4_CH4_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EA204u)

/** \brief EA204, ATOM4 Channel 4 Control Register in SOMI Mode */
#define GTM_ATOM4_CH4_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EA204u)

/** \brief EA204, ATOM4 Channel 4 Control Register in SOMP Mode */
#define GTM_ATOM4_CH4_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EA204u)

/** \brief EA204, ATOM4 Channel 4 Control Register in SOMS Mode */
#define GTM_ATOM4_CH4_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EA204u)

/** \brief EA208, ATOM4 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EA208u)

/** \brief EA20C, ATOM4 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EA20Cu)

/** \brief EA210, ATOM4 Channel 4 CCU0 Compare Register */
#define GTM_ATOM4_CH4_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EA210u)

/** \brief EA214, ATOM4 Channel 4 CCU1 Compare Register */
#define GTM_ATOM4_CH4_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EA214u)

/** \brief EA218, ATOM4 Channel 4 CCU0 Counter Register */
#define GTM_ATOM4_CH4_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EA218u)

/** \brief EA21C, ATOM4 Channel 4 Status Register */
#define GTM_ATOM4_CH4_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EA21Cu)

/** \brief EA220, ATOM4 Channel 4 Interrupt Notification Register */
#define GTM_ATOM4_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EA220u)

/** \brief EA224, ATOM4 Channel 4 Interrupt Enable Register */
#define GTM_ATOM4_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EA224u)

/** \brief EA228, ATOM4 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM4_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EA228u)

/** \brief EA22C, ATOM4 Channel 4 Interrupt Mode Configuration Register */
#define GTM_ATOM4_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EA22Cu)

/** \brief EA280, ATOM4 Channel 5 ARU read address Register */
#define GTM_ATOM4_CH5_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EA280u)

/** \brief EA284, ATOM4 Channel 5 Control Register */
#define GTM_ATOM4_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EA284u)

/** \brief EA284, ATOM4 Channel 5 Control Register in SOMB Mode */
#define GTM_ATOM4_CH5_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EA284u)

/** \brief EA284, ATOM4 Channel 5 Control Register in SOMC Mode */
#define GTM_ATOM4_CH5_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EA284u)

/** \brief EA284, ATOM4 Channel 5 Control Register in SOMI Mode */
#define GTM_ATOM4_CH5_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EA284u)

/** \brief EA284, ATOM4 Channel 5 Control Register in SOMP Mode */
#define GTM_ATOM4_CH5_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EA284u)

/** \brief EA284, ATOM4 Channel 5 Control Register in SOMS Mode */
#define GTM_ATOM4_CH5_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EA284u)

/** \brief EA288, ATOM4 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EA288u)

/** \brief EA28C, ATOM4 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EA28Cu)

/** \brief EA290, ATOM4 Channel 5 CCU0 Compare Register */
#define GTM_ATOM4_CH5_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EA290u)

/** \brief EA294, ATOM4 Channel 5 CCU1 Compare Register */
#define GTM_ATOM4_CH5_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EA294u)

/** \brief EA298, ATOM4 Channel 5 CCU0 Counter Register */
#define GTM_ATOM4_CH5_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EA298u)

/** \brief EA29C, ATOM4 Channel 5 Status Register */
#define GTM_ATOM4_CH5_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EA29Cu)

/** \brief EA2A0, ATOM4 Channel 5 Interrupt Notification Register */
#define GTM_ATOM4_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EA2A0u)

/** \brief EA2A4, ATOM4 Channel 5 Interrupt Enable Register */
#define GTM_ATOM4_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EA2A4u)

/** \brief EA2A8, ATOM4 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM4_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EA2A8u)

/** \brief EA2AC, ATOM4 Channel 5 Interrupt Mode Configuration Register */
#define GTM_ATOM4_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EA2ACu)

/** \brief EA300, ATOM4 Channel 6 ARU read address Register */
#define GTM_ATOM4_CH6_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EA300u)

/** \brief EA304, ATOM4 Channel 6 Control Register */
#define GTM_ATOM4_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EA304u)

/** \brief EA304, ATOM4 Channel 6 Control Register in SOMB Mode */
#define GTM_ATOM4_CH6_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EA304u)

/** \brief EA304, ATOM4 Channel 6 Control Register in SOMC Mode */
#define GTM_ATOM4_CH6_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EA304u)

